"3-finger Horizontal Swipe" = "Kolmen sormen vaakapyyhkäisy";
"3-finger Vertical Swipe" = "Kolmen sormen pystypyyhkäisy";
"4-finger Horizontal Swipe" = "Neljän sormen vaakapyyhkäisy";
"4-finger Vertical Swipe" = "Neljän sormen pystypyyhkäisy";
"About" = "Tietoja";
"About %@" = "Tietoja %@sta";
"Accessibility" = "Käyttöapu";
"Acknowledgments" = "Kiitokset";
"Active app" = "Aktiivinen ohjelma";
"Active screen" = "Aktiivisella näytöllä";
"Active Space" = "Aktiivinen tila";
"Add a running app" = "Lisää käynnissä oleva sovellus";
"Add an app from disk" = "Lisää sovellus levyltä";
"Additional controls" = "Lisäohjaimet";
"Additional controls…" = "Lisäohjaimet…";
"Advanced" = "Kehittyneemmät";
"After keys are released" = "Kun näppäimet on vapautettu";
"After release" = "Vapautuksen jälkeen";
"Align windows" = "Tasaa ikkunat";
"Align windows:" = "Tasaa ikkunat:";
"All apps" = "Kaikki apit";
"All data from this form will be made public, as a ticket on github.com" = "Tämän lomakkeen tiedot tulevat julkisiksi Github.comiin";
"All screens" = "Kaikki ruudut";
"All Spaces" = "Kaikki tilat";
"Allowed" = "Sallittu";
"Alphabetical" = "Aakkosjärjestys";
"Alphabetical Order" = "Aakkosjärjestys";
"Also select windows using:" = "Valitse ikkunoita myös:";
"AltTab crashed last time you used it. Sending a crash report will help get the issue fixed" = "AltTab kaatui viime käyttökerralla. Vikaraportin lähettäminen auttaa ongelman korjaamiseen";
"AltTab is currently set to show Applications. This setting is only available when AltTab is set to show Windows." = "AltTab on tällä hetkellä asetettu näyttämään apit. Tämä asetus on käytettävissä vain, kun AltTab on asetettu näyttämään ikkunat.";
"AltTab is running without Screen Recording permissions. Thumbnails won’t show." = "AltTabilla ei ole näytöntallennusoikeuksia. Pikkukuvat eivät näy.";
"AltTab needs some permissions" = "AltTab tarvitsee joitakin oikeuksia";
"AltTab will show if the window is currently minimized or fullscreen with a status icon." = "AltTab näyttää kuvakkeella, onko ikkuna pienennetty tai koko näytöllä.";
"Always" = "Aina";
"Always send crash reports" = "Lähetä vikaraportit aina";
"and press" = "ja paina";
"and press:" = "ja paina:";
"Animations" = "Animaatiot";
"Animations…" = "Animaatiot…";
"App (BundleID starting with)" = "Appi (BundleID alkaen)";
"App Icons" = "Appikuvakkeet";
"App is hidden" = "Sovellus on piilotettu";
"App is running but has no open window" = "Sovellus on käynnissä, mutta sillä ei ole ikkunoita";
"Apparition delay" = "Ilmestysviive";
"Apparition delay of Switcher" = "Switcherin ilmestymisen viive";
"Apparition delay:" = "Ilmestymisviive:";
"Appearance" = "Ulkoasu";
"Application Name" = "Apin nimi";
"Application Name - Window Title" = "Apin nimi - ikkunan otsikko";
"Applications" = "Apit";
"Are you sure you don’t want a response?" = "Oletko varma ettet halua vastausta?";
"Arrow keys" = "Nuolinäppäimet";
"Ask whether to send crash reports" = "Kysy lähetetäänkö vikaraportit";
"Auto" = "Automaattinen";
"Auto-install updates periodically" = "Asenna päivitykset automaattisesti aika ajoin";
"Blacklists" = "Estolistat";
"Cancel" = "Peru";
"Cancel and hide" = "Peru ja piilota";
"Capture windows in the background" = "Tallenna ikkunat taustalla";
"Center" = "Keskellä";
"Check for updates now…" = "Tarkista päivitykset nyt…";
"Check for updates periodically" = "Tarkista päivitykset aika ajoin";
"Check for updates…" = "Tarkista päivitykset…";
"Check permissions…" = "Tarkista käyttöoikeudet...";
"Close window" = "Sulje ikkuna";
"Conflicting shortcut" = "Pikanäppäinristiriita";
"Controls" = "Ohjaimet";
"Crash reports policy" = "Vikaraporttien käytäntö";
"Crash reports policy:" = "Vikaraporttien käytäntö:";
"Cursor follows focus" = "Osoitin seuraa kohdennusta";
"Customize App Icons style…" = "Mukauta appikuvakkeiden tyyliä…";
"Customize Thumbnails style…" = "Mukauta pikkukuvien tyyliä…";
"Customize Titles style…" = "Mukauta otsikoiden tyyliä…";
"Dark" = "Tumma";
"Debug tools" = "Vianmääritystyökalut";
"Disabled" = "Pois";
"Do nothing" = "Älä tee mitään";
"Don’t check for updates periodically" = "Älä tarkista päivityksiä";
"Don’t send" = "Älä lähetä";
"Don’t show windows from these apps" = "Älä näytä ikkunoita näistä ohjelmista";
"Done" = "Valmis";
"End" = "Loppu";
"Exceptions" = "Poikkeukset";
"Export settings…" = "Vie asetukset…";
"Export…" = "Vie…";
"Fade in animation of Preview" = "Esikatselun häivytysanimaatio";
"Fade out animation" = "Haihtumisen animaation";
"Fade out animation of Switcher" = "Switcherin häivytysanimaatio";
"Fade out animation:" = "Häipymisanimaatio:";
"Failed to import settings" = "Asetusten tuonti epäonnistui";
"Focus selected window" = "Kohdenna valittu ikkuna";
"Fullscreen window" = "Koko näytön ikkuna";
"Fullscreen windows:" = "Koko näytön ikkunat:";
"Fullscreen/Defullscreen window" = "Ikkuna koko näyttöön/pois";
"General" = "Yleinen";
"Gesture" = "Eleet";
"Grant permission" = "Myönnä lupa";
"Hidden windows:" = "Piilotetut ikkunat:";
"Hide" = "Piilota";
"Hide app badges" = "Piilota appien merkit";
"Hide app badges:" = "Piilota appien merkit:";
"Hide apps with no open window" = "Piilota apit, joilla ei ole avoimia ikkunoita";
"Hide apps with no open window:" = "Piilota apit, joilla ei ole avoimia ikkunoita:";
"Hide colored circles on mouse hover" = "Piilota väriympyrät hiirellä osoittaessakin";
"Hide colored circles on mouse hover:" = "Piilota väriympyrät hiirellä osoittaessakin:";
"Hide in %@" = "Piilota %@ssa";
"Hide Space number labels" = "Piilota tilojen numerot";
"Hide Space number labels:" = "Piilota tilojen numerot:";
"Hide status icons" = "Piilota statusikonit";
"Hide status icons:" = "Piilota statusikonit:";
"Hide window thumbnails:" = "Piilota pikkukuvat:";
"Hide/Show app" = "Piilota/näytä appi";
"High" = "Korkea";
"Highest" = "Korkein";
"Hold" = "Pidä";
"Horizontal Swipe with Four Fingers" = "Pyyhkäise vasemmalle/oikealle 4 sormella";
"Horizontal Swipe with Three Fingers" = "Pyyhkäise vasemmalle/oikealle 3 sormella";
"I think the app could be improved with…" = "Ohjelmaa voisi mielestäni parantaa…";
"Ignore shortcuts when active" = "Sivuuta pikanäppäimet, kun aktiivinen";
"Ignore shortcuts while a window from these apps is active" = "Älä käsittele pikanäppäimiä näiden ohjelmien ollessa aktiivisia";
"Import settings…" = "Tuo asetukset…";
"Import…" = "Tuo…";
"Keep open" = "Pidä auki";
"Keep open and search" = "Pidä auki ja hae";
"Language" = "Kieli";
"Language Change" = "Kielen vaihtaminen";
"Large" = "Suuri";
"Later" = "Älä käynnistä uudelleen";
"Latest releases" = "Uusimmat julkaisut";
"Leading" = "Reunaan";
"Left" = "Vasen";
"Light" = "Vaalea";
"Lock search" = "Lukitse haku";
"Max height on screen:" = "Maksimikorkeus näytöllä:";
"Max width on screen:" = "Maksimileveys näytöllä:";
"Medium" = "Keskikoko";
"Menubar icon" = "Valikkorivin kuvake";
"Menubar icon:" = "Valikkorivin kuvake:";
"Middle" = "Keski";
"Minimize/Deminimize window" = "Pienennä/palauta ikkuna";
"Minimized windows:" = "Pienennetyt ikkunat:";
"Miscellaneous" = "Sekalaista";
"Miscellaneous:" = "Sekalaista:";
"Mouse hover" = "Hiiren liike";
"Multiple screens" = "Useita näyttöjä";
"Never" = "Ei koskaan";
"Never send crash reports" = "Älä lähetä vikaraportteja";
"No Window" = "Ei ikkunaa";
"Non-active apps" = "Ei-aktiiviset apit";
"Non-visible Spaces" = "Ei-näkyvät työtilat";
"Normal" = "Normaali";
"Not allowed" = "Ei sallittu";
"NSHumanReadableCopyright" = "GPL-3.0 -lisenssi";
"Only if the window is fullscreen" = "Vain, jos ikkuna on koko näytöllä";
"Only on different screen" = "Vain eri näytöllä";
"Open Accessibility Preferences…" = "Avaa käyttöapuasetukset…";
"Open Accessibility Settings…" = "Avaa käyttöapuasetukset…";
"Open Screen Recording Preferences…" = "Avaa näytöntallennuksen asetukset…";
"Open Screen Recording Settings…" = "Avaa näytön tallennusasetukset…";
"Open System Settings to confirm, and continue" = "Avaa järjestelmäasetukset vahvistaaksesi ja jatkaaksesi";
"Open Trackpad Preferences…" = "Avaa ohjauslevyn asetukset…";
"Open Trackpad Settings…" = "Avaa ohjauslevyn asetukset…";
"Optional: email (if you want a reply)" = "Vapaaehtoinen: sähköposti (jos haluat vastauksen)";
"Order windows by" = "Järjestä ikkunat";
"Please fill in the form" = "Täytä lomake";
"Policies" = "Käytännöt";
"Preferences…" = "Asetukset…";
"Preview selected window" = "Esikatsele valittua ikkunaa";
"Preview selected window:" = "Esikatsele valittua ikkunaa:";
"Preview the selected window." = "Esikatsele valittu ikkuna.";
"Quit" = "Lopeta";
"Quit %@" = "Lopeta %@";
"Quit app" = "Lopeta appi";
"Recently Created" = "Luontijärjestys";
"Recently Created First" = "Äskettäin luodut ensin";
"Recently Focused" = "Kohdennusjärjestys";
"Recently Focused First" = "Äskettäin kohdennetut ensin";
"Remember my choice" = "Muista valintani";
"Reset preferences and restart" = "Nollaa asetukset ja aloita alusta";
"Reset preferences and restart…" = "Nollaa asetukset ja käynnistä uudelleen…";
"Reset settings and restart" = "Palauta asetukset ja käynnistä uudelleen";
"Reset settings and restart…" = "Palauta asetukset ja käynnistä uudelleen…";
"Restart Now" = "Käynnistä uudelleen nyt";
"Rows of thumbnails:" = "Pikkukuvien rivit:";
"Screen including menu bar" = "Näytöllä, jossa valikkorivi";
"Screen including mouse" = "Näytöllä, jossa hiiri";
"Screen Recording" = "Näytön tallennus";
"Screen showing AltTab" = "Näytöllä, jossa AltTab";
"Search" = "Haku";
"Select next window" = "Valitse seuraava ikkuna";
"Select previous window" = "Valitse edellinen ikkuna";
"Select windows on mouse hover" = "Valitse ikkunat hiiren osoittimella";
"Select windows using arrow keys" = "Valitse ikkunat nuolinäppäimillä";
"Select windows using vim keys" = "Valitse ikkunat VIM -näppäimillä";
"Send" = "Lähetä";
"Send a crash report?" = "Lähetä vikaraportti?";
"Send anyway" = "Lähetä silti";
"Send debug profile (CPU, memory, etc)" = "Lähetä debug-profiili (prosessori, muisti ym.)";
"Send feedback" = "Lähetä palautetta";
"Send feedback…" = "Lähetä palautetta…";
"Settings imported" = "Asetukset tuotu";
"Settings…" = "Asetukset";
"Share improvement ideas, or report bugs" = "Jaa parannusehdotuksia tai raportoi bugeja";
"Shortcut" = "Pikakomento";
"Shortcut 1" = "Pikanäppäin 1";
"Shortcut 2" = "Pikanäppäin 2";
"Shortcut 3" = "Pikanäppäin 3";
"Shortcut 4" = "Pikanäppäin 4";
"Shortcut 5" = "Pikanäppäin 5";
"Shortcut already assigned to another action: %@" = "Pikanäppäin on jo määritetty toiseen toimintoon: %@";
"Shortcuts When Active" = "Pikakomennot aktiivisena";
"Shortcuts when active…" = "Pikakomennot aktiivisena…";
"Show" = "Näytä";
"Show & Hide" = "Näytä ja piilota";
"Show an item in the switcher for each window, or for each application. Windows will be focused, whereas applications will be activated." = "Näytä kohde kytkimessä jokaiselle ikkunaan tai jokaiselle sovellukselle. Ikkunat kohdennetaan, kun taas apit aktivoidaan.";
"Show apps with no open window" = "Näytä apit, joilla ei ole avointa ikkunaa";
"Show at the end" = "Näytä lopussa";
"Show fullscreen windows" = "Näytä koko näytön ikkunat";
"Show hidden windows" = "Näytä piilotetut ikkunat";
"Show in switcher" = "Näytä vaihtajassa";
"Show minimized windows" = "Näytä pienennetyt ikkunat";
"Show on" = "Näytä";
"Show on:" = "Näytä:";
"Show standard tabs as windows" = "Näytä välilehdet ikkunoina";
"Show standard tabs as windows:" = "Näytä välilehdet ikkunoina:";
"Show titles" = "Näytä otsikot";
"Show windows from applications" = "Näytä ikkunat apeista";
"Show windows from screens" = "Näytä ikkunat näytöiltä";
"Show windows from Spaces" = "Näytä ikkunat tiloista";
"Show windows from:" = "Näytä ikkunat:";
"Size" = "Koko";
"Skipped" = "Ohitettu";
"Small" = "Pieni";
"Some apps like Finder or Preview use standard tabs which act like independent windows. Some other apps like web browsers use custom tabs which act in unique ways and are not actual windows. AltTab can't list those separately." = "Jotkut apit, kuten Finder tai Esikatselu, käyttävät vakio -välilehtiä, jotka toimivat kuin itsenäiset ikkunat. Jotkut muut apit, kuten verkkoselaimet, käyttävät mukautettuja välilehtiä, jotka toimivat ainutlaatuisilla tavoilla eivätkä ole todellisia ikkunoita. AltTab ei voi luetella niitä erikseen.";
"Source code repository" = "Lähdekoodi";
"Space" = "Tila";
"Space Order" = "Tilajärjestys";
"Start" = "Alku";
"Start at login" = "Avaa sisäänkirjauduttaessa";
"Start at login:" = "Avaa sisäänkirjauduttaessa:";
"Support this project" = "Tue tätä projektia";
"Swipe with Four Fingers" = "Pyyhkäise 4 sormella";
"Swipe with Three Fingers" = "Pyyhkäise 3 sormella";
"Switch between 3 different styles. You can customize them." = "Vaihda 3 eri tyylin välillä. Voit mukauttaa niitä.";
"System" = "Järjestelmä";
"System Default" = "Järjestelmäasetus";
"The ⌘⎋ (command+escape) shortcut may be used by macOS for GameOverlay.\n\nYour change would assign it to: %@.\n\nIf you want to continue, make sure that the GameOverlay shortcut is disabled.\nAlso note that macOS has reported bugs where the shortcut may still interfere while disabled." = "macOS saattaa käyttää ⌘⎋ (komento+escape) -pikakomentoa GameOverlaylle.\n\nMuutoksesi määrittäisi sen kohteelle: %@.\n\nJos haluat jatkaa, varmista, että GameOverlayn pikakomento on poissa käytöstä.\nHuomaa myös, että macOS:ssä on raportoitu virheistä, joissa pikakomento saattaa silti häiritä, vaikka se olisi poissa käytöstä.";
"The ⎋ (escape) key is reserved by some macOS shortcuts (e.g. ⌘⌥⎋ will show the Force Quit Applications window).\n\nIf you want to use ⎋, make sure that Hold modifiers are neither: ⌘⌥, ⌘⌥⇧, or ⌘⌥⇧⌃" = "⎋ (escape)-näppäin on varattu joillekin macOS-pikakomennoille (esim. ⌘⌥⎋ avaa Pakota lopettamaan -ikkunan).\n\nJos haluat käyttää ⎋-näppäintä, varmista, ettei pidettävät muunninnäppäimet ole: ⌘⌥, ⌘⌥⇧ tai ⌘⌥⇧⌃.";
"The ⎋ (escape) key is reserved by some macOS shortcuts (e.g. ⌘⌥⎋ will show the Force Quit Applications window).\n\nYour change would assign it to: %@.\n\nIf you want to use ⎋, make sure that Hold modifiers are neither: ⌘⌥, ⌘⌥⇧, or ⌘⌥⇧⌃" = "⎋ (escape)-näppäin on varattu joillekin macOS-pikakomennoille (esim. ⌘⌥⎋ avaa Pakota lopettamaan -ikkunan).\n\nMuutoksesi määrittäisi sen kohteelle: %@.\n\nJos haluat käyttää ⎋-näppäintä, varmista, ettei pidettävät muunninnäppäimet ole: ⌘⌥, ⌘⌥⇧ tai ⌘⌥⇧⌃.";
"The application needs to restart to apply the imported settings." = "Sovellus on käynnistettävä uudelleen tuotujen asetusten käyttöönottoa varten.";
"The application needs to restart to apply the language change." = "Kielimuutos edellyttää sovelluksen käynnistämistä uudelleen.";
"Theme" = "Teema";
"Theme:" = "Teema:";
"Then release:" = "Sitten päästä:";
"This permission is needed to focus windows after you release the shortcut" = "Tarvitaan ikkunoiden valitsemiseksi";
"This permission is needed to show screenshots and titles of open windows" = "Tarvitaan ikkunoiden otsikoiden ja pikkukuvien näyttämiseen";
"This permission is needed to show thumbnails and preview of open windows" = "Tämä oikeus tarvitaan pikkukuvien ja avoimien ikkunoiden näyttämiseen";
"Thumbnails" = "Pikkukuvat";
"Title" = "Otsikko";
"Title truncation" = "Otsikon lyhennys";
"Titles" = "Otsikot";
"Trackpad haptic feedback" = "Ohjauslevyn haptinen palaute";
"Trigger" = "Laukaisin";
"Trigger shortcut" = "Pikakomento";
"Unassign existing shortcut and continue" = "Poista olemassa oleva pikanäppäinmääritys ja jatka";
"Updates policy" = "Päivityskäytäntö";
"Updates policy:" = "Päivityskäytäntö:";
"Use the app without this permission. Thumbnails won’t show." = "Käytä sovellusta ilman tätä oikeutta. Pikkukuvat eivät näy.";
"Version" = "Versio";
"Vertical Swipe with Four Fingers" = "Pyyhkäise ylös/alas 4 sormella";
"Vertical Swipe with Three Fingers" = "Pyyhkäise ylös/alas 3 sormella";
"View existing discussions" = "Näytä keskustelut";
"Vim keys" = "Vim-näppäimet";
"Vim keys already assigned to other actions:\n%@" = "Vim-näppäimet on jo määritetty toisiin toimintoihin:\n%@";
"Visibility" = "Näkyvyys";
"Visible Spaces" = "Näkyvät tilat";
"When disabled, avoids the macOS purple screen-recording indicator, and avoids flickers when playing DRM video. Thumbnails will be less up-to-date." = "Kun tämä on poissa käytöstä, vältetään macOS:n violetti näytöntallennuksen ilmaisin ja vältetään välkkymistä DRM-videota toistettaessa. Esikatselukuvat ovat vähemmän ajantasaisia.";
"When fullscreen" = "Kun koko näytöllä";
"When no open window" = "Kun ikkunoita ei ole auki";
"While open, press:" = "Kun auki, paina:";
"Window app icon size:" = "Ohjelmaikonin koko:";
"Window is fullscreen" = "Ikkuna on koko näytöllä";
"Window is minimized" = "Ikkuna on pienennetty";
"Window is on every Space" = "Ikkuna on jokaisessa tilassa";
"Window is on Space %d" = "Ikkuna on tilassa %d";
"Window max width in row:" = "Ikkunan maksimileveys rivillä:";
"Window min width in row:" = "Ikkunan minimileveys rivillä:";
"Window order:" = "Ikkunoiden järjestys:";
"Window Title" = "Ikkunan otsikko";
"Window title contains" = "Ikkunan otsikko sisältää";
"Window title font size:" = "Otsikkotekstin koko:";
"Window title truncation:" = "Ikkunaotsikoiden lyhennys:";
"Windows" = "Ikkunat";
"You can’t undo this action." = "Et voi perua tätä toimintoa.";
"You didn’t write your email, thus can’t receive any response." = "Et antanut sähköpostiosoitettasi, joten emme voi lähettää sinulle vastausta.";
"You may need to disable some conflicting system gestures" = "Saatat joutua poistamaan käytöstä ristiriitaisia järjestelmäeleitä";
